[
  {
    "id": 1,
    "name": "WhatsApp Messenger",
    "image": "https://i.ibb.co.com/VpM7ZhDf/whatsapps.jpg",
    "rating": 4.4,
    "downloads": "1M+",
    "companyName": "Meta Platforms, Inc.",
    "description": "WhatsApp Messenger is a **free, simple, reliable, and private messaging and calling application** used by over 2 billion people in more than 180 countries. It allows users to send text messages, voice messages, make high-quality voice and video calls globally, and share photos, documents, and user locations without requiring a subscription fee. The platform emphasizes end-to-end encryption, ensuring that only you and the person you're communicating with can read or listen to your messages, and nobody in between, not even WhatsApp.\n\nBeyond basic one-on-one chats, WhatsApp facilitates group chats for connecting with family and friends, making it easy to share life's moments. The 'Status' feature allows users to share text, photos, videos, and animated GIFs that disappear after 24 hours, similar to Instagram or Snapchat stories. Business accounts offer an expanded set of tools for companies to communicate directly with customers, making the app versatile for both personal and commercial use.\n\nKey features also include the ability to use WhatsApp on your web browser or desktop (WhatsApp Web), quick photo and video capturing directly within the app, and backup options for keeping your chat history secure. Its vast global reach and commitment to privacy have cemented its place as the world's leading mobile messaging platform, continuously evolving to add new functionalities like disappearing messages and multi-device support.",
    "size": 55,
    "reviews": "150M",
    "ratingAvg": 4.4,
    "ratings": [
      {
        "name": "1 star",
        "count": "5M"
      },
      {
        "name": "2 star",
        "count": "6M"
      },
      {
        "name": "3 star",
        "count": "15M"
      },
      {
        "name": "4 star",
        "count": "35M"
      },
      {
        "name": "5 star",
        "count": "89M"
      }
    ]
  },
  {
    "id": 2,
    "name": "TikTok - Videos, Shop & LIVE",
    "image": "https://i.ibb.co.com/qYCRcW63/tiktok.png",
    "rating": 4.1,
    "downloads": "2M+",
    "companyName": "TikTok Pte. Ltd.",
    "description": "TikTok is the global destination for short-form mobile videos. It's a platform powered by personalization, offering a seemingly endless stream of unique, authentic, and entertaining videos tailored specifically for each user based on what they watch, like, and share. The **'For You' feed** is famous for its uncanny ability to discover new content and creators, propelling trends and cultural moments across the world. Users can effortlessly find niche communities from comedy and gaming to cooking and education.\n\nThe app's power lies in its **robust and user-friendly creation tools**. It provides millions of free music clips and sounds, along with filters, effects, and editing features that allow anyone to become a creator, regardless of their video editing skills. Duet, Stitch, and reaction features encourage collaborative content creation, rapidly spreading challenges and memes and fostering a highly interactive user base. This democratization of content creation is what sets TikTok apart.\n\nIn addition to entertainment, TikTok is aggressively integrating e-commerce through **TikTok Shop and LIVE commerce**. Creators can tag products in their videos and live streams, turning content directly into a shopping experience. This evolution makes the platform a powerful tool not just for social networking and entertainment, but also for brand discovery, product marketing, and instant purchasing, constantly blurring the lines between media consumption and consumerism.",
    "size": 105,
    "reviews": "40M",
    "ratingAvg": 4.1,
    "ratings": [
      {
        "name": "1 star",
        "count": "3M"
      },
      {
        "name": "2 star",
        "count": "4M"
      },
      {
        "name": "3 star",
        "count": "5M"
      },
      {
        "name": "4 star",
        "count": "10M"
      },
      {
        "name": "5 star",
        "count": "18M"
      }
    ]
  },
  {
    "id": 3,
    "name": "Instagram",
    "image": "https://i.ibb.co.com/xSDrHXJ3/Instagram.webp",
    "rating": 3.9,
    "downloads": "3M+",
    "companyName": "Meta Platforms, Inc.",
    "description": "Instagram is a visual-first social networking service designed to **bring you closer to the people and things you love**—friends, family, creators, and brands. Initially focused on static photo sharing with unique filters, it has evolved into a multimedia platform supporting high-definition photos, short-form videos (Reels), longer-form video (IGTV/Video), and ephemeral content (Stories). It acts as a digital scrapbook and a dynamic media consumption hub, allowing users to scroll through meticulously curated feeds.\n\nThe platform's core revolves around visual self-expression and discovery. **Instagram Stories** remains a cornerstone feature, enabling users to share candid moments that vanish after 24 hours, complete with interactive stickers, polls, and music. The recent push for **Instagram Reels** directly challenges short-video competitors by offering advanced editing tools and audio libraries, encouraging users to create viral, engaging vertical video content. This focus on video ensures the platform stays relevant in a rapidly changing media landscape.\n\nFurthermore, Instagram serves as a vital tool for business and creator monetization. **Shopping features** allow users to buy products directly from posts and Stories, and the platform offers tools for creators to earn revenue through badges, affiliate links, and branded content. For many, Instagram is not just a social app, but a **digital portfolio, a marketing channel, and a shopping destination**, cementing its multifaceted role in the digital world.",
    "size": 80,
    "reviews": "100M",
    "ratingAvg": 3.9,
    "ratings": [
      {
        "name": "1 star",
        "count": "10M"
      },
      {
        "name": "2 star",
        "count": "8M"
      },
      {
        "name": "3 star",
        "count": "12M"
      },
      {
        "name": "4 star",
        "count": "25M"
      },
      {
        "name": "5 star",
        "count": "45M"
      }
    ]
  },
  {
    "id": 4,
    "name": "Facebook",
    "image": "https://i.ibb.co.com/MDZrRHpc/Facebook.png",
    "rating": 4.0,
    "downloads": "5M+",
    "companyName": "Meta Platforms, Inc.",
    "description": "Facebook is the world's largest social media platform, designed to **help you keep up with friends, family, and people who share your interests**. It enables users to post status updates, share photos and videos, and react to content using various emotions. The News Feed is the central hub, where users consume a mix of content from their network, businesses they follow, and algorithmic suggestions, making it a comprehensive tool for both personal connection and news consumption.\n\nThe app goes far beyond simple social networking with its extensive feature set. **Facebook Groups** offer private and public spaces for niche communities to gather and discuss shared interests, from hobbies and local events to professional development. **Facebook Marketplace** is a thriving ecosystem for buying and selling goods locally, providing a free and accessible classifieds service directly within the social app. The platform also includes comprehensive event management tools, allowing users to create, promote, and RSVP to physical and virtual gatherings.\n\nFor businesses, Facebook is an indispensable **marketing and advertising platform**. Companies use Pages to build their brand identity, interact with customers, and run highly targeted advertising campaigns to reach specific demographics. With deep integration across all Meta platforms, Facebook remains the **dominant player in connecting people and businesses** across the digital landscape, providing a wide array of tools for every social interaction need.",
    "size": 65,
    "reviews": "160M",
    "ratingAvg": 4.0,
    "ratings": [
      {
        "name": "1 star",
        "count": "12M"
      },
      {
        "name": "2 star",
        "count": "10M"
      },
      {
        "name": "3 star",
        "count": "18M"
      },
      {
        "name": "4 star",
        "count": "35M"
      },
      {
        "name": "5 star",
        "count": "85M"
      }
    ]
  },
  {
    "id": 5,
    "name": "Messenger",
    "image": "https://i.ibb.co.com/2YpfP4xV/message.jpg",
    "rating": 4.7,
    "downloads": "4M+",
    "companyName": "Meta Platforms, Inc.",
    "description": "Messenger is Meta's dedicated app for instant messaging, voice, and video communication, providing a streamlined experience for **connecting with friends, family, and co-workers** quickly and efficiently. While once integrated with the main Facebook app, it now functions as a powerful, standalone platform, prioritizing fast and feature-rich conversations. Key capabilities include encrypted text messaging, high-quality audio calls, and immersive video chat features like Rooms.\n\nThe app is packed with interactive and expressive features to enhance communication. Users can send stickers, GIFs, and fun augmented reality (AR) effects during video calls. **Chat Themes** and custom reactions allow for personalization of every conversation, making chats more engaging. Messenger also seamlessly supports **group messaging**, offering features like polls and shared media albums, which are essential for coordinating plans or managing team discussions efficiently.\n\nCrucially, Messenger integrates deeply with the broader Facebook ecosystem, allowing users to connect with contacts from both Facebook and Instagram without switching apps. It supports end-to-end encryption for secret conversations and offers features like disappearing messages for enhanced privacy. Its commitment to speed, fun, and deep platform integration has solidified Messenger's position as a **top-tier global communication app**, used for everything from casual chats to mission-critical video conferences.",
    "size": 45,
    "reviews": "120M",
    "ratingAvg": 4.7,
    "ratings": [
      {
        "name": "1 star",
        "count": "3M"
      },
      {
        "name": "2 star",
        "count": "4M"
      },
      {
        "name": "3 star",
        "count": "8M"
      },
      {
        "name": "4 star",
        "count": "20M"
      },
      {
        "name": "5 star",
        "count": "85M"
      }
    ]
  },
  {
    "id": 6,
    "name": "Spotify: Music and Podcasts",
    "image": "https://i.ibb.co.com/0pNX19SS/spotify.png",
    "rating": 4.3,
    "downloads": "9M+",
    "companyName": "Spotify AB",
    "description": "Spotify is the world's most popular digital music, podcast, and video service, giving you access to **millions of songs and other content from artists all over the world**. The core experience is driven by its powerful recommendation engine, which curates personalized playlists and radio stations based on your listening habits. Whether you're exploring the latest chart-toppers, diving into niche genres, or rediscovering old classics, Spotify offers an unparalleled discovery experience.\n\nThe platform has heavily invested in **podcasts**, establishing itself as a leading destination for both independent and exclusive audio shows. Users can follow their favorite hosts, download episodes for offline listening, and enjoy seamless integration of music and talk content. The user interface is designed for effortless navigation, making it easy to create and manage personal libraries, follow friends' activity, and share music across various social media platforms directly from the app.\n\nSpotify offers both a **free, ad-supported tier** and a **premium subscription** that removes ads, allows unlimited skips, and enables high-quality streaming and offline playback. The ecosystem supports numerous devices, including phones, tablets, smart speakers, and gaming consoles, ensuring your music follows you everywhere. This broad accessibility and commitment to personalization make Spotify the **go-to platform for audio entertainment** globally.",
    "size": 52,
    "reviews": "35M",
    "ratingAvg": 4.3,
    "ratings": [
      {
        "name": "1 star",
        "count": "2M"
      },
      {
        "name": "2 star",
        "count": "3M"
      },
      {
        "name": "3 star",
        "count": "4M"
      },
      {
        "name": "4 star",
        "count": "9M"
      },
      {
        "name": "5 star",
        "count": "17M"
      }
    ]
  },
  {
    "id": 7,
    "name": "Telegram",
    "image": "https://i.ibb.co.com/Y41fZw6s/telegram.webp",
    "rating": 4.1,
    "downloads": "6M+",
    "companyName": "Telegram FZ-LLC",
    "description": "Telegram is a cloud-based mobile and desktop messaging app focused on **speed and security**. It's renowned for its robust encryption and ability to sync seamlessly across all user devices—phone, tablet, and desktop—simultaneously. Unlike many competitors, Telegram uses a unique client-server architecture that allows users to access their messages and media from multiple platforms without losing data, offering true cross-platform functionality.\n\nOne of Telegram's most distinguishing features is its support for **massive group chats, known as Supergroups, which can hold up to 200,000 members**. It also features **Channels**, a tool for broadcasting messages to unlimited audiences, making it a powerful platform for news dissemination, community management, and large-scale public announcements. The platform is highly customizable, featuring themes, stickers, and a rich ecosystem of bots that can automate tasks, integrate third-party services, and add interactive elements to chats.\n\nSecurity and privacy are core to Telegram's identity. It offers **Secret Chats** with end-to-end encryption for those who require the highest level of privacy, complete with a self-destruct timer for messages. Furthermore, the company prides itself on never selling user data and maintaining a transparent, open-source protocol for its API. This dedication to privacy, coupled with its advanced features, has made Telegram a favored alternative for users seeking a secure and feature-rich communication platform.",
    "size": 38,
    "reviews": "15M",
    "ratingAvg": 4.1,
    "ratings": [
      {
        "name": "1 star",
        "count": "1.5M"
      },
      {
        "name": "2 star",
        "count": "2M"
      },
      {
        "name": "3 star",
        "count": "2.5M"
      },
      {
        "name": "4 star",
        "count": "4M"
      },
      {
        "name": "5 star",
        "count": "5M"
      }
    ]
  },
  {
    "id": 8,
    "name": "Snapchat",
    "image": "https://i.ibb.co.com/zVGRjQsf/chat.png",
    "rating": 4.1,
    "downloads": "7M+",
    "companyName": "Snap Inc.",
    "description": "Snapchat is a camera-first social media app that's built around visual communication, making it a **fast and fun way to share the moment** with friends. Its core function revolves around 'Snaps'—photos or short videos that are typically ephemeral, disappearing after they've been viewed. This focus on transient moments encourages more spontaneous and candid interactions, moving away from the curated perfection often found on other platforms.\n\nCentral to the Snapchat experience are **Lenses** (Augmented Reality filters) and **Stories**. Lenses use advanced AR technology to overlay graphics, facial distortions, and visual effects onto the user and their environment, constantly driving viral trends. Stories allow users to share a collection of Snaps throughout the day that disappear after 24 hours, giving friends a chronological look at their daily life. The platform is highly visual and focused on real-time, in-the-moment sharing.\n\nBeyond direct messaging, Snapchat features **Snap Maps**, which allows users to share their real-time location with friends, and **Discover**, a curated section featuring short-form, editorially produced content from media publishers and creators. The platform has successfully targeted a younger demographic with its unique, playful approach to social media. It remains a key tool for visual messaging, fun filters, and candid, direct communication among close friends.",
    "size": 75,
    "reviews": "25M",
    "ratingAvg": 4.1,
    "ratings": [
      {
        "name": "1 star",
        "count": "2.5M"
      },
      {
        "name": "2 star",
        "count": "3M"
      },
      {
        "name": "3 star",
        "count": "4.5M"
      },
      {
        "name": "4 star",
        "count": "6M"
      },
      {
        "name": "5 star",
        "count": "9M"
      }
    ]
  },
  {
    "id": 9,
    "name": "X (Twitter)",
    "image": "https://i.ibb.co.com/mrxkWy7Y/twitter.png",
    "rating": 4.2,
    "downloads": "500M+",
    "companyName": "X Corp.",
    "description": "X (formerly Twitter) is a global microblogging and social networking service where users post and interact with messages called **'posts'** (formerly tweets). It functions as a real-time information network, often being the first place where **breaking news and global conversations** erupt. Its primary strength lies in its speed and its ability to connect users directly with public figures, journalists, and global thought leaders. The platform is crucial for following live events and trending topics instantly.\n\nThe user interface prioritizes a continuous, reverse-chronological stream of short updates, designed to encourage rapid sharing and consumption of information. Users can engage through likes, reposts, and quotes, facilitating viral spread and direct public discussion. The platform also utilizes hashtags and trending topics to organize the immense volume of content, helping users quickly find relevant conversations about current events, politics, sports, and entertainment.\n\nIn recent updates, X has introduced features to encourage longer-form content creation, including extended character limits for subscribers and live video streaming capabilities. It remains a **powerful public forum** that influences media and public opinion worldwide. For businesses and individuals seeking to establish a public voice and engage in real-time dialogue, X serves as an indispensable tool for immediate communication and broad societal monitoring.",
    "size": 90,
    "reviews": "32M",
    "ratingAvg": 4.2,
    "ratings": [
      {
        "name": "1 star",
        "count": "2.5M"
      },
      {
        "name": "2 star",
        "count": "3.5M"
      },
      {
        "name": "3 star",
        "count": "5M"
      },
      {
        "name": "4 star",
        "count": "8M"
      },
      {
        "name": "5 star",
        "count": "13M"
      }
    ]
  },
  {
    "id": 10,
    "name": "YouTube",
    "image": "https://i.ibb.co.com/pjThgbkL/youtube.webp",
    "rating": 4.5,
    "downloads": "10M+",
    "companyName": "Google LLC",
    "description": "YouTube is the **world's largest video-sharing platform**, providing users with endless hours of content ranging from educational tutorials and music videos to vlogs and professional documentaries. It serves as the primary search engine for video content, offering a vast library of user-generated and corporate media. The platform uses sophisticated algorithms to recommend videos, ensuring that users always find personalized content tailored to their interests, making it a dominant force in digital entertainment and learning.\n\nFor creators, YouTube provides a **comprehensive suite of tools** to upload, manage, and monetize their content through the YouTube Partner Program. Subscriptions and notifications allow viewers to follow their favorite channels closely. The introduction of **YouTube Shorts** is a significant feature, offering a vertical video format to compete in the short-form content space, allowing creators to tap into a wider mobile audience with quick, engaging clips.\n\nYouTube is not just for viewing; it's also a powerful tool for **live streaming, content aggregation, and community building**. Features like comments, community tabs, and live chat foster deep engagement between creators and their audience. Its universal reach and massive content library have solidified YouTube's status as a **global media powerhouse**, influencing popular culture and providing a reliable source for information, music, and entertainment for billions of people.",
    "size": 110,
    "reviews": "180M",
    "ratingAvg": 4.5,
    "ratings": [
      {
        "name": "1 star",
        "count": "10M"
      },
      {
        "name": "2 star",
        "count": "10M"
      },
      {
        "name": "3 star",
        "count": "20M"
      },
      {
        "name": "4 star",
        "count": "40M"
      },
      {
        "name": "5 star",
        "count": "100M"
      }
    ]
  },
  {
    "id": 11,
    "name": "Google Maps",
    "image": "https://i.ibb.co.com/fzdYJ6HV/Map.png",
    "rating": 4.7,
    "downloads": "15M+",
    "companyName": "Google LLC",
    "description": "Google Maps is the world's most comprehensive and widely used **navigation and location service**, providing real-time GPS-guided directions, traffic conditions, and transit information across the globe. It supports multiple modes of travel, including driving, walking, cycling, and public transit, offering dynamic routing to help users find the fastest and most efficient way to their destination. The accuracy of its mapping data is constantly updated through satellite imagery and user contributions, ensuring reliable geographical information.\n\nBeyond simple navigation, Google Maps serves as a **powerful local discovery tool**. Users can search for millions of businesses, restaurants, landmarks, and points of interest, complete with opening hours, contact details, user photos, and reviews powered by the Google Local Guides community. The app offers features like **Street View**, allowing users to virtually explore locations, and **Live View** (AR navigation), which uses augmented reality to display directions directly onto the real world using the phone's camera.\n\nThe platform integrates seamlessly with other Google services and offers personalized features, such as saving favorite places, creating custom lists, and sharing estimated arrival times with contacts. Its ability to provide detailed maps of almost every corner of the world, combined with essential local information and powerful routing algorithms, makes Google Maps an indispensable **daily utility for billions of users** navigating the physical world.",
    "size": 95,
    "reviews": "150M",
    "ratingAvg": 4.7,
    "ratings": [
      {
        "name": "1 star",
        "count": "3M"
      },
      {
        "name": "2 star",
        "count": "4M"
      },
      {
        "name": "3 star",
        "count": "8M"
      },
      {
        "name": "4 star",
        "count": "35M"
      },
      {
        "name": "5 star",
        "count": "100M"
      }
    ]
  },
  {
    "id": 12,
    "name": "Netflix",
    "image": "https://i.ibb.co.com/SwTk3XTz/netflix.webp",
    "rating": 4.4,
    "downloads": "18M+",
    "companyName": "Netflix, Inc.",
    "description": "Netflix is the world's leading subscription-based **streaming service for movies, TV shows, and original programming**, offering thousands of titles across virtually every genre. It pioneered the video-on-demand model, allowing users to watch content anytime, anywhere, on any internet-connected device. The platform is famous for its **personalized recommendation engine**, which uses viewing history and ratings to suggest titles, making content discovery effortless and keeping users engaged with new shows tailored to their tastes.\n\nThe company is a major producer of content, heavily investing in **Netflix Originals** across series, films, and documentaries. These exclusive titles are a primary draw for subscribers, driving cultural conversations and earning numerous industry awards. The platform also offers features like multiple user profiles per account, parental controls, and a 'Skip Intro' button, all designed to enhance the viewing experience and cater to diverse household needs.\n\nFunctionally, Netflix allows users to **download selected movies and shows** to their mobile devices for offline viewing, perfect for travel or areas with poor connectivity. It supports various streaming qualities, including HD and 4K, depending on the subscription tier. Its commitment to quality content, user-centric features, and global availability ensures that Netflix remains the **dominant premium entertainment platform** worldwide.",
    "size": 70,
    "reviews": "28M",
    "ratingAvg": 4.4,
    "ratings": [
      {
        "name": "1 star",
        "count": "2M"
      },
      {
        "name": "2 star",
        "count": "3M"
      },
      {
        "name": "3 star",
        "count": "4M"
      },
      {
        "name": "4 star",
        "count": "7M"
      },
      {
        "name": "5 star",
        "count": "12M"
      }
    ]
  },
  {
    "id": 13,
    "name": "Pinterest",
    "image": "https://i.ibb.co.com/HfHq2x2P/pinterest.webp",
    "rating": 4.5,
    "downloads": "24M+",
    "companyName": "Pinterest",
    "description": "Pinterest is a **visual discovery engine** and social media service, often described as the 'world's catalog of ideas.' Unlike traditional social networks focused on connecting friends, Pinterest centers on connecting users with visual ideas—or 'Pins'—for everything from cooking recipes and fashion inspiration to home decor and DIY projects. Users 'Pin' images and videos to personalized digital 'boards,' which act as visual collections of their interests and future plans.\n\nThe platform's primary use is for **inspiration and planning**. Whether you're planning a wedding, decorating a new home, or looking for workout routines, Pinterest's powerful visual search tool and recommendations algorithm help surface relevant ideas. The interface is highly visual, prioritizing high-quality imagery over text, making the browsing experience intuitive and engaging. This focus on future-oriented content is what makes it unique among its competitors.\n\nPinterest has successfully integrated **e-commerce features**, turning inspirational Pins into shoppable products. Users can click on a Pin to find similar items or purchase the product directly, making the discovery process seamless with the buying journey. For brands, it's a key platform for visual marketing and driving referral traffic. Ultimately, Pinterest is a vibrant, idea-driven community that helps millions of people worldwide **discover and execute their creative interests and life projects**.",
    "size": 60,
    "reviews": "30M",
    "ratingAvg": 4.5,
    "ratings": [
      {
        "name": "1 star",
        "count": "1.5M"
      },
      {
        "name": "2 star",
        "count": "2M"
      },
      {
        "name": "3 star",
        "count": "3.5M"
      },
      {
        "name": "4 star",
        "count": "7M"
      },
      {
        "name": "5 star",
        "count": "16M"
      }
    ]
  },
  {
    "id": 14,
    "name": "Google Chrome",
    "image": "https://i.ibb.co.com/cK5fTtpd/Chrome.png",
    "rating": 4.3,
    "downloads": "28M+",
    "companyName": "Google LLC",
    "description": "Google Chrome is the **leading web browser** across desktop and mobile devices, known for its **speed, simplicity, and robust security features**. On mobile, it offers a clean, minimalistic interface that prioritizes fast page loading and intuitive navigation. Its ability to seamlessly sync bookmarks, history, and passwords across all devices signed into a Google account provides a consistent and efficient browsing experience for billions of users worldwide.\n\nSecurity is a cornerstone of Chrome's design, featuring integrated tools like Google Safe Browsing, which alerts users to dangerous sites and downloads. The browser is constantly updated to patch vulnerabilities and improve performance, ensuring users are protected from modern web threats. Additional features like **Incognito Mode** offer privacy, ensuring browsing history is not saved locally, and the data saver mode can compress web pages to reduce mobile data usage.\n\nChrome offers extensive functionality, including the ability to open and quickly switch between multiple tabs, use voice search, and translate web pages instantly. Its deep integration with the Google ecosystem—including Google Search, Gmail, and Google Drive—makes it the preferred gateway to the internet for most users. Its ubiquity and focus on performance, security, and a consistent user experience have made it the **dominant browser for the modern internet**.",
    "size": 70,
    "reviews": "130M",
    "ratingAvg": 4.3,
    "ratings": [
      {
        "name": "1 star",
        "count": "8M"
      },
      {
        "name": "2 star",
        "count": "9M"
      },
      {
        "name": "3 star",
        "count": "15M"
      },
      {
        "name": "4 star",
        "count": "30M"
      },
      {
        "name": "5 star",
        "count": "68M"
      }
    ]
  },
  {
    "id": 15,
    "name": "Reddit",
    "image": "https://i.ibb.co.com/R4VM9Djm/reddit.png",
    "rating": 4.6,
    "downloads": "100M+",
    "companyName": "Reddit, Inc.",
    "description": "Reddit, often called 'the front page of the internet,' is a vast network of communities based on user-submitted content, allowing users to **'dive into anything'**. It operates as a massive collection of forums, known as **'subreddits,'** dedicated to every conceivable topic, from niche hobbies and professional fields to major global news and humorous memes. Content is primarily submitted by users and is then voted on by the community, with the most popular posts rising to the top of the feed.\n\nThe core of the Reddit experience is the sense of belonging to specific, highly engaged communities. Subreddits are managed by volunteer moderators who enforce community rules, ensuring focused and often high-quality discussion within each niche. The platform is a unique blend of social media, forum, and content aggregator, where users can find real-time, grassroots information and diverse perspectives on virtually any subject.\n\nReddit encourages long-form, thoughtful discussion through upvoting/downvoting of comments, which elevates the most insightful contributions. Features like Reddit Gold and awards allow users to recognize quality content and support the community. For those seeking **unfiltered, community-driven information and specialized conversations**, Reddit remains the digital melting pot where virtually every interest, no matter how obscure, has a dedicated and passionate following.",
    "size": 65,
    "reviews": "5M",
    "ratingAvg": 4.6,
    "ratings": [
      {
        "name": "1 star",
        "count": "100K"
      },
      {
        "name": "2 star",
        "count": "200K"
      },
      {
        "name": "3 star",
        "count": "500K"
      },
      {
        "name": "4 star",
        "count": "1.5M"
      },
      {
        "name": "5 star",
        "count": "2.7M"
      }
    ]
  },
  {
    "id": 16,
    "name": "Discord",
    "image": "https://i.ibb.co.com/Mk79c4B7/Discord.jpg",
    "rating": 4.7,
    "downloads": "520M+",
    "companyName": "Discord Inc.",
    "description": "Discord is a **voice, video, and text communication platform** originally built for gamers but has since expanded to be **'your place to talk'** for every type of community. It organizes users into **'Servers'**—private, invite-only spaces—which are further divided into themed text and voice channels. This structure allows communities to manage detailed, organized discussions around specific topics, making it ideal for teamwork, fan communities, educational groups, and gaming clans.\n\nCommunication within Discord is fluid and multifaceted. Users can jump into **Voice Channels** for seamless, low-latency audio communication, often used for cooperative gaming or virtual hangouts. Text Channels support rich media sharing, GIFs, and code snippets, while direct messaging allows for private one-on-one or small group chats. The platform is highly customizable, with bots and integrations allowing server administrators to automate tasks, moderate content, and add interactive features like music players and mini-games.\n\nDiscord's strength lies in its ability to create a sense of intimacy and permanence that typical social media lacks. It provides a persistent, always-on space for groups to convene, fostering deeper connections through shared voice and video experiences. Its versatility and robust feature set have established Discord as the **leading digital clubhouse** for communities of all sizes and interests across the internet.",
    "size": 85,
    "reviews": "20M",
    "ratingAvg": 4.7,
    "ratings": [
      {
        "name": "1 star",
        "count": "500K"
      },
      {
        "name": "2 star",
        "count": "700K"
      },
      {
        "name": "3 star",
        "count": "1.3M"
      },
      {
        "name": "4 star",
        "count": "4.5M"
      },
      {
        "name": "5 star",
        "count": "13M"
      }
    ]
  },
  {
    "id": 17,
    "name": "LinkedIn",
    "image": "https://i.ibb.co.com/HDZjTBXm/linkdin.png",
    "rating": 4.3,
    "downloads": "33M+",
    "companyName": "LinkedIn",
    "description": "LinkedIn is the world's premier **professional networking platform**, dedicated to helping users **build their professional network**, advance their careers, and gain industry insights. It serves as a digital resume and portfolio, allowing individuals to showcase their work experience, skills, education, and professional accomplishments. The main feed is tailored to professional news, articles, and updates from colleagues, companies, and industry thought leaders.\n\nThe platform is indispensable for **job seekers and recruiters**. Job postings are a key feature, with personalized recommendations based on the user's profile and preferences. Recruiters use LinkedIn's powerful search tools to find and connect with suitable candidates directly, making it the dominant platform for professional hiring globally. The **LinkedIn Learning** feature provides subscription-based online courses to help members acquire new skills and certifications, further enhancing career development.\n\nLinkedIn encourages active professional engagement through posting articles, participating in specialized groups, and offering endorsements for peers' skills. This interaction helps to establish professional credibility and increase visibility within specific industries. For anyone looking to **manage their career, find employment, or stay informed about their field**, LinkedIn provides the necessary tools and community to thrive in the professional world.",
    "size": 70,
    "reviews": "40M",
    "ratingAvg": 4.3,
    "ratings": [
      {
        "name": "1 star",
        "count": "3M"
      },
      {
        "name": "2 star",
        "count": "4M"
      },
      {
        "name": "3 star",
        "count": "6M"
      },
      {
        "name": "4 star",
        "count": "10M"
      },
      {
        "name": "5 star",
        "count": "17M"
      }
    ]
  },
  {
    "id": 18,
    "name": "Zoom",
    "image": "https://i.ibb.co.com/7t4K9fxV/zoom.jpg",
    "rating": 4.0,
    "downloads": "600M+",
    "companyName": "Zoom Video Communications",
    "description": "Zoom is a leading cloud-based platform for **Cloud Meetings & Video Conferencing**, rapidly becoming the global standard for business, education, and social remote interactions. It offers an easy-to-use interface for hosting and joining high-quality video and audio conferences, webinars, and virtual events. Its stability and reliability under high load helped it become the go-to solution for maintaining connectivity during periods of remote work and distance learning.\n\nKey features that drive Zoom's popularity include virtual backgrounds, screen sharing with annotation tools, and the ability to record meetings for later review. It supports large participant numbers, with free accounts providing robust functionality for small meetings and paid tiers catering to enterprise-level needs with features like single sign-on (SSO), administrative controls, and dedicated customer support. Breakout Rooms allow hosts to divide large meetings into smaller discussion groups, enhancing collaborative efficiency.\n\nZoom is not just for formal meetings; it’s widely used for social hangouts, family gatherings, and remote training sessions. Its scheduling integration with major calendar services (Google, Outlook) and cross-platform compatibility ensures that anyone, regardless of their operating system or device, can easily connect. Its focus on **simplicity, scalability, and high-fidelity communication** has made Zoom the defining tool for modern virtual interaction.",
    "size": 50,
    "reviews": "15M",
    "ratingAvg": 4.0,
    "ratings": [
      {
        "name": "1 star",
        "count": "1.5M"
      },
      {
        "name": "2 star",
        "count": "2M"
      },
      {
        "name": "3 star",
        "count": "3M"
      },
      {
        "name": "4 star",
        "count": "4.5M"
      },
      {
        "name": "5 star",
        "count": "4M"
      }
    ]
  },
  {
    "id": 19,
    "name": "Canva",
    "image": "https://i.ibb.co.com/h1cWk7sm/canva.jpg",
    "rating": 4.8,
    "downloads": "120M+",
    "companyName": "Canva",
    "description": "Canva is an immensely popular **graphic design, photo & video editor** tool that makes professional design accessible to everyone, regardless of skill level. It provides an intuitive, drag-and-drop interface and a vast library of free and premium templates, stock photos, icons, and fonts. Users can effortlessly create everything from social media posts, presentations, and posters to brochures and logos, democratizing the design process for small businesses, students, and everyday users.\n\nOne of Canva's core strengths is its **rich template ecosystem**. It offers thousands of pre-designed layouts optimized for every platform and purpose, which users can easily customize with their own branding, colors, and content. The platform supports team collaboration in real-time, allowing multiple users to work on a single design simultaneously, a crucial feature for marketing and design teams in various organizations.\n\nCanva has expanded into both **video editing and website creation**, offering a one-stop-shop for digital content needs. The mobile app provides nearly all the features of the desktop version, ensuring users can design on the go. Its combination of powerful, yet simple, tools, coupled with an extensive asset library, makes Canva the **definitive solution for non-designers seeking professional-quality visual content**.",
    "size": 40,
    "reviews": "5M",
    "ratingAvg": 4.8,
    "ratings": [
      {
        "name": "1 star",
        "count": "50K"
      },
      {
        "name": "2 star",
        "count": "100K"
      },
      {
        "name": "3 star",
        "count": "250K"
      },
      {
        "name": "4 star",
        "count": "1M"
      },
      {
        "name": "5 star",
        "count": "3.6M"
      }
    ]
  },
  {
    "id": 20,
    "name": "Amazon Shopping",
    "image": "https://i.ibb.co.com/gL5BrnHZ/amazon.jpg",
    "rating": 4.1,
    "downloads": "700M+",
    "companyName": "Amazon Mobile LLC",
    "description": "Amazon Shopping is the mobile gateway to the world's largest online retailer, allowing users to **shop millions of products and services** directly from their phone or tablet. The app offers a personalized shopping experience, using browsing and purchase history to provide tailored product recommendations and deals. It provides the full functionality of the Amazon website, enabling quick product searches, detailed review reading, and seamless checkout processes with secure payment options.\n\nThe app is essential for **managing the entire customer journey**, from initial discovery to post-purchase support. Users can track their orders in real-time, manage their subscriptions, and easily access customer service. Features like **SmileCodes and camera search** allow users to scan products or barcodes in the physical world to instantly find and purchase them on Amazon, bridging the gap between offline and online shopping effortlessly.\n\nPrime members benefit greatly from the app, gaining instant access to exclusive deals, fast, free shipping options, and integrated content like Prime Video streaming. The Amazon app remains the **dominant force in mobile e-commerce**, offering convenience, reliability, and an unparalleled selection of goods, making it a daily habit for millions of consumers globally.",
    "size": 60,
    "reviews": "30M",
    "ratingAvg": 4.1,
    "ratings": [
      {
        "name": "1 star",
        "count": "3M"
      },
      {
        "name": "2 star",
        "count": "4M"
      },
      {
        "name": "3 star",
        "count": "5M"
      },
      {
        "name": "4 star",
        "count": "8M"
      },
      {
        "name": "5 star",
        "count": "10M"
      }
    ]
  }
]